## Staging: ecr
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |              NAME               |
|----------|---------------------------------|
| recreate | `aws_ecr_repository.ai_answers` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_repository.ai_answers must be replaced
-/+ resource "aws_ecr_repository" "ai_answers" {
      ~ arn                  = "arn:aws:ecr:ca-central-1:992382783569:repository/ai-answers" -> (known after apply)
      ~ id                   = "ai-answers" -> (known after apply)
      ~ name                 = "ai-answers" -> "ai-answers-staging" # forces replacement
      ~ registry_id          = "992382783569" -> (known after apply)
      ~ repository_url       = "992382783569.dkr.ecr.ca-central-1.amazonaws.com/ai-answers" -> (known after apply)
      - tags                 = {} -> null
        # (2 unchanged attributes hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ ecr_repository_arn = "arn:aws:ecr:ca-central-1:992382783569:repository/ai-answers" -> (known after apply)
  ~ ecr_repository_url = "992382783569.dkr.ecr.ca-central-1.amazonaws.com/ai-answers" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.ai_answers"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
